[{"framework_id": "24a46ca3-d9f0-5121-9f81-c2bcf9bd4311", "framework_name": "AARC Respiratory Care", "framework_description": "Competencies for Entry into Respiratory Therapy Practice  Executive Summary  In 2015, the Taskforce on Competencies for Entry into Respiratory Therapy Practice was charged with using data from the 2015 and Beyond conferences, and later sub-groups, to determine the competencies needed by respiratory care practitioners who are entering into respiratory care professional practice. Members of the taskforce included representatives from the American Association for Respiratory Care (AARC), Commission on Accreditation for Respiratory Care, and National Board for Respiratory Care, along with liaisons from the three entities that were non-voting members. The taskforce reported an analysis and evaluation of all competencies and when these competencies should be acquired, either before or after entry into professional practice, as determined by the taskforce. The AARC Board of Directors approved this report in October 2016. ", "framework_uri": "https://www.nbrc.org/wp-content/uploads/2019/02/Therapist-Multiple-Choice-DCO-NBRC-website-effective-1-2015.pdf", "filename": "aarc-respiratory-care-competencies.txt"}, {"framework_id": "feda0695-2cf8-517d-ba44-eb9bb2f94431", "framework_name": "Automation ClearingHouse Model", "framework_description": " The Automation Competency Model framework was developed through a collaborative effort involving the Employment and Training Administration (ETA) and industry experts from the Automation Federation.  In July 2018, the Automation Federation convened subject matter experts and worked with ETA to update the model to reflect the most current knowledge and skills needed by today\\'s automation professionals. The update contains a realignment of skills and knowledge requirements including automation dynamics, latest industry standards, and updates to reflect performance management and decision support for industrial automation and control systems.  ", "framework_uri": "https://www.careeronestop.org/CompetencyModel/competency-models/pyramid-download.aspx?industry=automation", "filename": "Automation.txt"}, {"framework_id": "4f46972e-484e-566c-9b61-6237fee79e03", "framework_name": "Comerical Construction ClearingHouse Model", "framework_description": " In collaboration with the Associated General Contractors of America (AGC), the Employment and Training Administration (ETA) has worked with industry leaders to develop a comprehensive competency model for the commercial and industrial construction industry. The model is designed to evolve along with changing skill requirements. AGC has committed to working with its industry partners to keep the model current. ", "framework_uri": "https://www.careeronestop.org/CompetencyModel/competency-models/pyramid-download.aspx?industry=construction-commercial", "filename": "Commerical_construction.txt"}, {"framework_id": "9e733d6a-213e-5d74-b4d1-e4af857656d8", "framework_name": "Cybersecurity ClearingHouse Model", "framework_description": " The Employment and Training Administration (ETA) has worked with the Department of Homeland Security and the more than 20 federal departments and agencies that make up the National Initiative for Cybersecurity Education (NICE) to develop a comprehensive competency model for cybersecurity. Technical and subject matter experts from education, business, and industry also contributed to the model\\'s development.The DOL Cybersecurity Industry Model defines the latest skill and knowledge requirements needed by individuals whose activities impact the security of their organization\\'s cyberspace. The model incorporates competencies identified in the NICE National Cybersecurity Workforce Framework and complements the Framework by including both the competencies needed by the average worker who uses the Internet or the organization\\'s computer network, as well as cybersecurity professionals. The ETA model will be updated to reflect future changes to the Framework.  ", "framework_uri": "https://www.careeronestop.org/competencymodel/competency-models/cybersecurity.aspx", "filename": "Cybersecurity-Industry.txt"}, {"framework_id": "b0877b72-9c59-5617-8ea9-b7bffd3cee32", "framework_name": "Energy Generation, Transmission and Distribution Competency Model", "framework_description": " The competency model framework for energy generation, transmission, and distribution was developed through a collaborative effort involving the Employment and Training Administration (ETA) and the Center for Energy Workforce Development (CEWD).To ensure that the model reflects the knowledge and skills needed by today\\'s energy workforce, CEWD has taken the lead to update the model. The updated model contains new information on the need for Science and Information Technology skills and the importance of Ethics, Employability, and Entrepreneurship skills, as well as updated key behaviors in several competency areas.  ", "framework_uri": "https://www.careeronestop.org/CompetencyModel/competency-models/energy.aspx", "filename": "Energy.txt"}, {"framework_id": "d0f62b19-286f-5a53-be3b-18ac42953dd5", "framework_name": "Long-term Care, Supports, and Services Competency Model", "framework_description": " The Employment and Training Administration (ETA) has worked with technical and subject matter experts from education, business, and industry to develop a comprehensive competency model for the long-term care, supports, and services industry. The model is designed as a resource supporting workforce development efforts to prepare the workers who make it possible for the aging population and those with disabilities to live their lives with independence and dignity. The American Health Care Association (AHCA), the Paraprofessionals Healthcare Institute (PHI), the College of Direct Support, National Center for Assisted Living (NCAL), American Network of Community Options and Resources (ANCOR), Institute for the Future of Aging Services, the University of Minnesota Institute on Community Integration, and the University of Alaska, Anchorage Center for Human Development, and the National Alliance for Direct Support Professionals (NADSP) provided input and will continue to ensure that the model evolves to accommodate changing skill requirements. ", "framework_uri": "https://www.careeronestop.org/CompetencyModel/competency-models/long-term-care.aspx", "filename": "Long_Term_Care_Support_Services.txt"}, {"framework_id": "c84c563e-f215-5c9f-90f1-64a768aaea80", "framework_name": "Surgical Technologist Certifying Examination Content", "framework_description": " The CST examination content is based on tasks performed by CSTs nationwide. Job analysis surveys are conducted to identify specific tasks related to the frequency and importance of Surgical Technologists nationwide. The results of the job analysis are used to develop the content outline for the examination, which is evaluated on a prescribed schedule to ensure that the overall examination content reflects current surgical technology practices. ", "framework_uri": "http://www.nbstsa.org/sites/nbstsa/files/pdf/2019_CST_ContentOutlinerev2_0.pdf", "filename": "National_Board_of_Surgical_Technology_and_Surgical_Assisting.txt"}, {"framework_id": "9e5abbe8-e5b3-5058-8af7-c93d552408cb", "framework_name": "Multipurpose Occupational Systems Analysis Inventory - Close-Ended (MOSAIC) Competencies", "framework_description": " OPM has been conducting Governmentwide occupational studies using its Multipurpose Occupational Systems Analysis Inventory - Close-Ended (MOSAIC) methodology for more than  two decades. MOSAIC, a multipurpose, survey-based occupational analysis approach, is used to collect information from incumbents and supervisors on many occupations for a wide range of human resource management functions.  The competencies used in these MOSAIC studies are free and for your use ", "framework_uri": "https://www.opm.gov/policy.../competencies/mosaic-studies-and-competencies.xls", "filename": "OPM_Mosaic.txt"}, {"framework_id": "066f2e54-90c7-5f18-ab4d-64513a55a5a0", "framework_name": "Retail Competency Model", "framework_description": " Over the past year the Employment and Training Administration (ETA) has collaborated with industry leaders to develop a comprehensive competency model framework for the Retail Industry. The framework is designed to evolve along with changing skill requirements. The NRF Foundation, the research and education arm of the National Retail Federation, has committed to working with industry partners to keep this tool current. ", "framework_uri": "https://www.careeronestop.org/CompetencyModel/competency-models/retail.aspx", "filename": "Retail.txt"}, {"framework_id": "34224458-ca06-5832-8367-351855408a47", "framework_name": "Registered Respiratory Therapist", "framework_description": " The RRT credential is nationally recognized as the \\\\u201cstandard of excellence\\\\u201d for respiratory care professionals.The examinations for the RRT credential objectively and uniformly measure essential knowledge, skills and abilities required of advanced respiratory therapists. The NBRC evaluates the competency of respiratory therapists and ensures that graduates of accredited respiratory care education programs have every opportunity to earn the RRT credential. It is in high demand nationwide, and we work diligently to help to fill the shortage of qualified respiratory therapists in the field.The first examination for earning the RRT is the Therapist Multiple-Choice (TMC) Examination (prior to January 2015, it was known as the Written Registry Examination). The TMC Examination evaluates the abilities required of respiratory therapists at entry into practice and determines eligibility for the Clinical Simulation Examination (CSE). The CRT and/or RRT credentials are used as the basis for the licensure in all 49 states that regulate the practice of respiratory care. ", "framework_uri": "https://www.nbrc.org/examinations/rrt/", "filename": "Therapist-Multiple-Choice-DCO-NBRC.txt"}, {"framework_id": "6c1d16ae-2779-5703-92ef-99782eba84bc", "framework_name": "Transportation, Distribution, and Logistics Competency Model", "framework_description": "The competency model framework for the transportation, distribution and logistics industry was developed through a collaborative effort involving the Employment and Training Administration (ETA), the U.S. Department of Transportation (DOT), and leading industry and labor organizations.To ensure that the model reflects the knowledge and skills needed by today\\'s transportation, distribution and logistics workforce, ETA worked with DOT and industry stakeholders to update the original Model. Completed in February 2014, the updated model features a new Tier 5 providing background on specific transportation sectors and a reorganization of Tier 4, as well as several updated competency areas.   ", "framework_uri": "https://www.careeronestop.org/CompetencyModel/Competency-Models/transportation.aspx", "filename": "Transportation-Industry.txt"}, {"framework_id": "54a26a56-811b-5588-89c1-9e64f18276d1", "framework_name": "NIST NICE Cybersecurity Framework", "framework_description": "The NICE Framework, NIST Special Publication 800-181, is a national focused resource that categorizes and describes cybersecurity work. The NICE Framework establishes a taxonomy and common lexicon that describes cybersecurity work and workers irrespective of where or for whom the work is performed. The NICE Framework is intended to be applied in the public, private, and academic sectors.", "framework_uri": "https://www.nist.gov/file/372581", "filename": "nist_nice.txt"}, {"framework_id": "39d10a55-a1c4-508d-ab3f-55ee51625c3f", "framework_name": "ONET Knowledge, Skills, Abilities", "framework_description": "Occupational Network (ONET) collection of defined skills, knowledge and abilities, as defined in the ONET rating methodlogical description and update documentation.", "framework_uri": ["https://www.onetcenter.org/dl_files/AOSkills_ProcUpdate.pdf", "https://www.onetcenter.org/dl_files/AnalystProcUpdate.pdf"], "filename": "ONET_competencies.txt"}, {"framework_id": "efb9d2f3-9528-5fb3-8edb-0299b54336bf", "framework_name": "ESCO Skills and Competencies", "framework_description": "ESCO (European Skills, Competences, Qualifications and Occupations) is the European multilingual classification of Skills, Competences, Qualifications and Occupations. ESCO provides descriptions of 2942 occupations and 13.485 skills linked to these occupations, translated into 27 languages (all official EU languages plus Icelandic, Norwegian and Arabic). Over time, it will also display the qualifications awarded in the education and training systems from Member States, as well as qualifications issued by private awarding bodies. ", "framework_uri": "https://ec.europa.eu/esco/portal/download", "filename": "ESCO_competencies.txt"}]